package helpers;

public class PrimitiveTypesHelper {

    /*
     * Примітивні типи даних (8)
     *
     * 1) Цілі числа:
     *    byte(1 байт)
     *    short(2 байти)
     *    int(4 байтів)
     *    long(8 байтів)
     *
     * 2) Дробові числа:
     *    float
     *    double
     *
     * 3) Один символ:
     *    char
     *
     * 4) Логічний тип:
     *    boolean
     *
     * Найчастіше ми будемо використовувати:
     * int, double, char, boolean
     */

    /*
     * Оператори
     *
     * 1) Арифметичні оператори:
     *    +
     *    -
     *    *
     *    /
     *    %
     *
     * 2) Оператори порівняння:
     *    >
     *    <
     *    >=
     *    <=
     *    ==
     *    !=
     *
     * 3) Логічні оператори:
     *    &&
     *    ||
     *    !
     *
     * 4) Оператори присвоєння:
     *    +=
     *    -=
     *    *=
     *    /=
     */
}
